БухЭксп/InformationRegisters/СостоянияВыгрузкиВЦентрЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияВыгрузкиВЦентрЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовВыгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументовОсталось</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыгружатьНезавершенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/СостоянияВыгрузкиВЦентрЭДО/Forms/ЗапускВыгрузки/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИдентификаторЭДО = Параметры.ИдентификаторЭДО;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Не указан идентификатор учетной записи ЭДО для переноса документов'"),,,, Отказ);
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = РегистрыСведений.СостоянияВыгрузкиВЦентрЭДО.ПараметрыВыгрузки(ИдентификаторЭДО);
	Если ПараметрыВыгрузки <> Неопределено Тогда
		ВыгружатьДокументыСДаты = ЗначениеЗаполнено(ПараметрыВыгрузки.ДатаВыгрузкиДокументов);
		ДатаВыгрузкиДокументов = ПараметрыВыгрузки.ДатаВыгрузкиДокументов;
		ВыгружатьНезавершенные = ПараметрыВыгрузки.ВыгружатьНезавершенные;
	КонецЕсли;
	
	НастроитьОтображениеПараметровВыгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыгружатьДокументыСДатыПриИзменении(Элемент)
	
	НастроитьОтображениеПараметровВыгрузки(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапуститьВыгрузку(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(ИдентификаторЭДО) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана учетная запись ЭДО для переноса документов'"),,,, Отказ);
	КонецЕсли;
	
	Если ВыгружатьДокументыСДаты И Не ЗначениеЗаполнено(ДатаВыгрузкиДокументов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не указана дата выгрузки документов'"),,
			Элементы.ДатаВыгрузкиДокументов.Имя,, Отказ);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыгрузки = Новый Структура;
	ПараметрыВыгрузки.Вставить("ИдентификаторЭДО", ИдентификаторЭДО);
	ПараметрыВыгрузки.Вставить("ДатаВыгрузкиДокументов",
		?(ВыгружатьДокументыСДаты, ДатаВыгрузкиДокументов, '00010101'));
	ПараметрыВыгрузки.Вставить("ВыгружатьНезавершенные", ВыгружатьНезавершенные);
	Закрыть(ПараметрыВыгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВыгрузку(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОтображениеЭлементовФормы

&НаКлиентеНаСервереБезКонтекста
// Параметры:
//  Форма - см. РегистрСведений.СостоянияВыгрузкиВЦентрЭДО.Форма.ЗапускВыгрузки
Процедура НастроитьОтображениеПараметровВыгрузки(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ДатаВыгрузкиДокументов", "Доступность", Форма.ВыгружатьДокументыСДаты);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
